inayina/ros2-robot-digital-twin/firmware/esp32_microros_bridge/src/main.cpp
void IRAM_ATTR handleN20EncoderBenchChange() {
    const uint8_t next_state = readN20EncoderBenchState();

    portENTER_CRITICAL_ISR(&encoder_bench_mux);
    const uint8_t transition =
        (uint8_t)((n20_encoder_bench_last_state << 2U) | next_state);
    switch (transition) {
        case 0x1:
        case 0x7:
        case 0xE:
        case 0x8:
            n20_encoder_bench_count++;
            break;
        case 0x2:
        case 0xB:
        case 0xD:
        case 0x4:
            n20_encoder_bench_count--;
            break;
        case 0x0:
        case 0x5:
        case 0xA:
        case 0xF:
            break;
        default:
            n20_encoder_bench_invalid_transitions++;
            break;
    }
    n20_encoder_bench_last_state = next_state;
    portEXIT_CRITICAL_ISR(&encoder_bench_mux);
}

int32_t n20EncoderBenchCountSnapshot() {
    portENTER_CRITICAL(&encoder_bench_mux);
    const int32_t count = n20_encoder_bench_count;
    portEXIT_CRITICAL(&encoder_bench_mux);
    return count;
}

uint32_t n20EncoderBenchInvalidTransitionsSnapshot() {
    portENTER_CRITICAL(&encoder_bench_mux);
    const uint32_t invalid = n20_encoder_bench_invalid_transitions;
    portEXIT_CRITICAL(&encoder_bench_mux);
    return invalid;
}

void startN20EncoderBench() {
    pinMode(app_config::kN20BenchEncoderAPin, INPUT_PULLUP);
    pinMode(app_config::kN20BenchEncoderBPin, INPUT_PULLUP);

    const uint8_t initial_state = readN20EncoderBenchState();
    portENTER_CRITICAL(&encoder_bench_mux);
    n20_encoder_bench_count = 0;
    n20_encoder_bench_invalid_transitions = 0;
    n20_encoder_bench_last_state = initial_state;
    portEXIT_CRITICAL(&encoder_bench_mux);

    attachInterrupt(digitalPinToInterrupt(app_config::kN20BenchEncoderAPin),
                    handleN20EncoderBenchChange,
                    CHANGE);
    attachInterrupt(digitalPinToInterrupt(app_config::kN20BenchEncoderBPin),
                    handleN20EncoderBenchChange,
                    CHANGE);

    Serial.print("[ENC] N20 bench encoder start state=");
    Serial.println(initial_state);
}

void stopN20EncoderBench() {
    detachInterrupt(digitalPinToInterrupt(app_config::kN20BenchEncoderAPin));
    detachInterrupt(digitalPinToInterrupt(app_config::kN20BenchEncoderBPin));
}

N20ClosedLoopBenchConfig makeN20ClosedLoopBenchConfig() {
    N20ClosedLoopBenchConfig config = {};
    config.control_period_ms = app_config::kN20ClosedLoopBenchControlPeriodMs;
    config.print_interval_ms = app_config::kN20ClosedLoopBenchPrintIntervalMs;
    config.max_duration_ms = app_config::kN20ClosedLoopBenchMaxDurationMs;
    config.direction_change_coast_ms = app_config::kN20ClosedLoopBenchDirectionChangeCoastMs;
    config.invert_encoder_direction = app_config::kN20ClosedLoopBenchInvertEncoderDirection;
    config.max_target_rpm = app_config::kN20ClosedLoopBenchMaxTargetRpm;
    config.max_pwm = app_config::kN20ClosedLoopBenchMaxPwm;
    config.min_effective_pwm = app_config::kN20ClosedLoopBenchMinEffectivePwm;
    config.deadband_rpm = app_config::kN20ClosedLoopBenchDeadbandRpm;
    config.max_invalid_encoder_transitions =
        app_config::kN20ClosedLoopBenchMaxInvalidEncoderTransitions;
    config.profile_stop_ms = app_config::kN20ClosedLoopBenchProfileStopMs;
    config.encoder.counts_per_output_rev =
        app_config::kN20ClosedLoopBenchEncoderPulsesPerRev *
        app_config::kN20ClosedLoopBenchGearRatio *
        app_config::kN20ClosedLoopBenchEdgesPerPulse;
    config.encoder.filter_alpha = app_config::kN20ClosedLoopBenchEncoderFilterAlpha;
    config.profile_step1_start_ms = app_config::kN20ClosedLoopBenchProfileStep1StartMs;
    config.profile_step2_start_ms = app_config::kN20ClosedLoopBenchProfileStep2StartMs;
    config.profile_step3_start_ms = app_config::kN20ClosedLoopBenchProfileStep3StartMs;
    config.profile_step4_start_ms = app_config::kN20ClosedLoopBenchProfileStep4StartMs;
    config.profile_step5_start_ms = app_config::kN20ClosedLoopBenchProfileStep5StartMs;
    config.profile_step0_target_rpm = app_config::kN20ClosedLoopBenchProfileStep0TargetRpm;
    config.profile_step1_target_rpm = app_config::kN20ClosedLoopBenchProfileStep1TargetRpm;
    config.profile_step2_target_rpm = app_config::kN20ClosedLoopBenchProfileStep2TargetRpm;
    config.profile_step3_target_rpm = app_config::kN20ClosedLoopBenchProfileStep3TargetRpm;
    config.profile_step4_target_rpm = app_config::kN20ClosedLoopBenchProfileStep4TargetRpm;
    config.profile_step5_target_rpm = app_config::kN20ClosedLoopBenchProfileStep5TargetRpm;
    config.pid.kp = app_config::kN20ClosedLoopBenchKp;
    config.pid.ki = app_config::kN20ClosedLoopBenchKi;
    config.pid.kd = app_config::kN20ClosedLoopBenchKd;
    config.pid.output_min = -app_config::kN20ClosedLoopBenchMaxPwm;
    config.pid.output_max = app_config::kN20ClosedLoopBenchMaxPwm;
    config.pid.integral_min = app_config::kN20ClosedLoopBenchIntegralMin;
    config.pid.integral_max = app_config::kN20ClosedLoopBenchIntegralMax;
    return config;
}

DashboardMotorClosedLoopConfig makeDashboardMotorClosedLoopConfig() {
    DashboardMotorClosedLoopConfig config = {};
    config.encoder.counts_per_output_rev =
        app_config::kN20ClosedLoopBenchEncoderPulsesPerRev *
        app_config::kN20ClosedLoopBenchGearRatio *
        app_config::kN20ClosedLoopBenchEdgesPerPulse;
    config.encoder.filter_alpha = app_config::kN20ClosedLoopBenchEncoderFilterAlpha;
    config.control.command_timeout_ms = app_config::kMotorControlCommandTimeoutMs;
    config.control.min_command_timeout_ms = app_config::kMotorControlCommandTimeoutMinMs;
    config.control.max_command_timeout_ms = app_config::kMotorControlCommandTimeoutMaxMs;
    config.control.direction_change_coast_ms =
        app_config::kN20ClosedLoopBenchDirectionChangeCoastMs;
    config.control.max_abs_target_rpm = app_config::kN20ClosedLoopBenchMaxTargetRpm;
    config.control.min_effective_pwm = app_config::kN20ClosedLoopBenchMinEffectivePwm;
    config.control.deadband_rpm = app_config::kN20ClosedLoopBenchDeadbandRpm;
    config.control.default_motor_cmd_max_pwm = app_config::kMotorControlDefaultMaxPwm;
    config.control.max_command_max_pwm = app_config::kMotorControlCommandMaxPwm;
    config.control.pid.kp = app_config::kN20ClosedLoopBenchKp;
    config.control.pid.ki = app_config::kN20ClosedLoopBenchKi;
    config.control.pid.kd = app_config::kN20ClosedLoopBenchKd;
    config.control.pid.output_min = -app_config::kMotorControlCommandMaxPwm;
    config.control.pid.output_max = app_config::kMotorControlCommandMaxPwm;
    config.control.pid.integral_min = app_config::kN20ClosedLoopBenchIntegralMin;
    config.control.pid.integral_max = app_config::kN20ClosedLoopBenchIntegralMax;
    config.invert_encoder_direction = app_config::kN20ClosedLoopBenchInvertEncoderDirection;
    return config;
}

float n20ClosedLoopBenchTargetForElapsedMs(const N20ClosedLoopBenchConfig& config,
                                           uint32_t elapsed_ms) {
    if (elapsed_ms < config.profile_step1_start_ms) {
        return config.profile_step0_target_rpm;
    }
    if (elapsed_ms < config.profile_step2_start_ms) {
        return config.profile_step1_target_rpm;
    }
    if (elapsed_ms < config.profile_step3_start_ms) {
        return config.profile_step2_target_rpm;
    }
    if (elapsed_ms < config.profile_step4_start_ms) {
        return config.profile_step3_target_rpm;
    }
    if (elapsed_ms < config.profile_step5_start_ms) {
        return config.profile_step4_target_rpm;
    }
    return config.profile_step5_target_rpm;
}

