inayina/ros2-robot-digital-twin/firmware/esp32_microros_bridge/src/main.cpp
int8_t directionForTargetRpm(float rpm) {
    if (rpm > 0.0f) {
        return 1;
    }
    if (rpm < 0.0f) {
        return -1;
    }
    return 0;
}

float clampTargetRpm(float target_rpm, float max_target_rpm) {
    const float max_abs_target_rpm = (max_target_rpm < 0.0f) ? -max_target_rpm : max_target_rpm;
    return clampFloat(target_rpm, -max_abs_target_rpm, max_abs_target_rpm);
}

bool n20ClosedLoopBenchConfigValid(const N20ClosedLoopBenchConfig& config) {
    return config.control_period_ms > 0U &&
        config.print_interval_ms > 0U &&
        config.max_duration_ms > 0U &&
        config.encoder.counts_per_output_rev > 0.0f &&
        config.max_pwm >= 0.0f &&
        config.max_pwm <= 1.0f &&
        config.min_effective_pwm >= 0.0f &&
        config.min_effective_pwm <= config.max_pwm &&
        config.profile_stop_ms <= config.max_duration_ms;
}

void n20ClosedLoopBenchStop(N20ClosedLoopBenchRuntime& runtime, const char* reason) {
    if (reason != nullptr && reason[0] != '\0') {
        Serial.print("[N20_CLOSED_LOOP] stop: ");
        Serial.println(reason);
    }

    if (runtime.driver_ready) {
        runtime.tb6612.writeOutput(Tb6612Channel::kB, Tb6612OutputMode::kCoast, 0.0f);
        runtime.tb6612.setStandby(false);
    }

    stopN20EncoderBench();
    speedPidReset(runtime.pid);
    encoderRpmEstimatorInit(runtime.encoder);
    runtime.last_control_ms = 0U;
    runtime.last_print_ms = 0U;
    runtime.start_ms = 0U;
    runtime.direction_hold_until_ms = 0U;
    runtime.last_encoder_delta = 0;
    runtime.last_raw_rpm = 0.0f;
    runtime.last_filtered_rpm = 0.0f;
    runtime.last_target_rpm = 0.0f;
    runtime.last_pwm = 0.0f;
    runtime.last_error = 0.0f;
    runtime.last_direction = 0;
    runtime.drive_direction = 0;
    runtime.last_output_saturated = false;
    runtime.driver_ready = false;
    runtime.initialized = false;
}

bool n20ClosedLoopBenchInit(N20ClosedLoopBenchRuntime& runtime,
                            const N20ClosedLoopBenchConfig& config,
                            uint32_t now_ms) {
    if (runtime.initialized) {
        return runtime.driver_ready;
    }

    runtime = {};
    speedPidInit(runtime.pid);
    encoderRpmEstimatorInit(runtime.encoder);

    if (!runtime.tb6612.begin(makeTb6612ChannelBBenchConfig())) {
        Serial.println("[N20_CLOSED_LOOP] TB6612 B init failed");
        return false;
    }

    runtime.tb6612.writeOutput(Tb6612Channel::kB, Tb6612OutputMode::kCoast, 0.0f);
    runtime.tb6612.setStandby(false);

    startN20EncoderBench();
    encoderRpmEstimatorUpdate(runtime.encoder,
                              config.encoder,
                              n20EncoderBenchCountSnapshot(),
                              config.control_period_ms);
    runtime.start_ms = now_ms;
    runtime.last_control_ms = now_ms;
    runtime.last_print_ms = 0U;
    runtime.direction_hold_until_ms = 0U;
    runtime.last_encoder_delta = 0;
    runtime.last_raw_rpm = 0.0f;
    runtime.last_filtered_rpm = 0.0f;
    runtime.last_target_rpm = 0.0f;
    runtime.last_pwm = 0.0f;
    runtime.last_error = 0.0f;
    runtime.last_direction = 0;
    runtime.drive_direction = 0;
    runtime.last_output_saturated = false;
    runtime.csv_header_printed = false;
    runtime.completed = false;
    runtime.driver_ready = true;
    runtime.initialized = true;

    Serial.print("[N20_CLOSED_LOOP] enabled step profile period_ms=");
    Serial.println(config.control_period_ms);
    return true;
}

void n20ClosedLoopBenchPrint(const N20ClosedLoopBenchRuntime& runtime,
                             uint32_t elapsed_ms,
                             const char* status) {
    if (!runtime.csv_header_printed) {
        Serial.println(
            "timestamp_ms,target_rpm,actual_rpm,error_rpm,pwm,direction,encoder_delta,status,raw_rpm,filtered_rpm,integral,output_saturated,bench_phase,invalid_transitions");
    }

    Serial.print(elapsed_ms);
    Serial.print(",");
    Serial.print(runtime.last_target_rpm, 3);
    Serial.print(",");
    Serial.print(runtime.last_filtered_rpm, 3);
    Serial.print(",");
    Serial.print(runtime.last_error, 3);
    Serial.print(",");
    Serial.print(runtime.last_pwm, 3);
    Serial.print(",");
    Serial.print(runtime.drive_direction);
    Serial.print(",");
    Serial.print(runtime.last_encoder_delta);
    Serial.print(",");
    Serial.print(status);
    Serial.print(",");
    Serial.print(runtime.last_raw_rpm, 3);
    Serial.print(",");
    Serial.print(runtime.last_filtered_rpm, 3);
    Serial.print(",");
    Serial.print(runtime.pid.integral, 3);
    Serial.print(",");
    Serial.print(runtime.last_output_saturated ? 1 : 0);
    Serial.print(",");
    Serial.print(elapsed_ms);
    Serial.print(",");
    Serial.println(n20EncoderBenchInvalidTransitionsSnapshot());
}

void serviceN20ClosedLoopBench(N20ClosedLoopBenchRuntime& runtime, uint32_t now_ms) {
    const N20ClosedLoopBenchConfig config = makeN20ClosedLoopBenchConfig();

    if (!n20ClosedLoopBenchConfigValid(config)) {
        n20ClosedLoopBenchStop(runtime, "invalid config");
        runtime.completed = true;
        return;
    }

    if (runtime.completed) {
        return;
    }

    if (!n20ClosedLoopBenchInit(runtime, config, now_ms)) {
        return;
    }

    if (!isIntervalDue(now_ms, runtime.last_control_ms, config.control_period_ms)) {
        return;
    }

    const uint32_t dt_ms = now_ms - runtime.last_control_ms;
    if (dt_ms == 0U) {
        n20ClosedLoopBenchStop(runtime, "invalid dt");
        runtime.completed = true;
        return;
    }

    if (dt_ms > config.control_period_ms * 4U) {
        n20ClosedLoopBenchStop(runtime, "control period overrun");
        runtime.completed = true;
        return;
    }

    const uint32_t elapsed_ms = now_ms - runtime.start_ms;
    if (elapsed_ms >= config.max_duration_ms) {
        n20ClosedLoopBenchStop(runtime, "max duration");
        runtime.completed = true;
        return;
    }

    if (n20EncoderBenchInvalidTransitionsSnapshot() >
        config.max_invalid_encoder_transitions) {
        n20ClosedLoopBenchStop(runtime, "encoder invalid transitions");
        runtime.completed = true;
        return;
    }

