inayina/ros2-robot-digital-twin/firmware/esp32_microros_bridge/src/main.cpp
    const int32_t encoder_count = n20EncoderBenchCountSnapshot();
    runtime.last_control_ms = now_ms;
    EncoderRpmEstimatorSample encoder_sample =
        encoderRpmEstimatorUpdate(runtime.encoder, config.encoder, encoder_count, dt_ms);

    if (config.invert_encoder_direction) {
        encoder_sample.delta_count = -encoder_sample.delta_count;
        encoder_sample.direction = (int8_t)-encoder_sample.direction;
        encoder_sample.actual_rpm = -encoder_sample.actual_rpm;
        encoder_sample.filtered_rpm = -encoder_sample.filtered_rpm;
    }

    runtime.last_encoder_delta = encoder_sample.delta_count;
    runtime.last_raw_rpm = encoder_sample.actual_rpm;
    runtime.last_filtered_rpm = encoder_sample.filtered_rpm;
    runtime.last_target_rpm = clampTargetRpm(
        n20ClosedLoopBenchTargetForElapsedMs(config, elapsed_ms),
        config.max_target_rpm);
    if (elapsed_ms >= config.profile_stop_ms) {
        runtime.last_target_rpm = 0.0f;
    }
    runtime.last_error = runtime.last_target_rpm - runtime.last_filtered_rpm;

    float pwm = 0.0f;
    runtime.last_output_saturated = false;
    const int8_t requested_direction = directionForTargetRpm(runtime.last_target_rpm);

    if (requested_direction != 0 &&
        runtime.last_direction != 0 &&
        requested_direction != runtime.last_direction &&
        now_ms >= runtime.direction_hold_until_ms) {
        runtime.direction_hold_until_ms = now_ms + config.direction_change_coast_ms;
        speedPidReset(runtime.pid);
    }

    const bool direction_hold_active = now_ms < runtime.direction_hold_until_ms;
    const bool target_zero = runtime.last_target_rpm == 0.0f;
    if (target_zero || direction_hold_active || !encoder_sample.valid) {
        speedPidReset(runtime.pid);
        runtime.tb6612.writeOutput(Tb6612Channel::kB, Tb6612OutputMode::kCoast, 0.0f);
        runtime.tb6612.setStandby(false);
        runtime.drive_direction = 0;
    } else {
        const SpeedPidOutput pid_output = speedPidUpdate(
            runtime.pid,
            config.pid,
            runtime.last_target_rpm,
            runtime.last_filtered_rpm,
            dt_ms);
        pwm = clampFloat(pid_output.output,
                         -config.max_pwm,
                         config.max_pwm);
        runtime.last_output_saturated = pid_output.saturated || pwm != pid_output.output;

        if ((runtime.last_target_rpm > 0.0f && pwm < 0.0f) ||
            (runtime.last_target_rpm < 0.0f && pwm > 0.0f) ||
            fabsf(runtime.last_error) <= config.deadband_rpm) {
            pwm = 0.0f;
        }

        if (pwm != 0.0f && fabsf(pwm) < config.min_effective_pwm) {
            pwm = (pwm > 0.0f) ? config.min_effective_pwm : -config.min_effective_pwm;
        }

        runtime.tb6612.setStandby(true);
        if (!runtime.tb6612.writeDuty(Tb6612Channel::kB, pwm)) {
            n20ClosedLoopBenchStop(runtime, "TB6612 writeDuty failed");
            runtime.completed = true;
            return;
        }
        runtime.drive_direction = directionForTargetRpm(pwm);
    }

    runtime.last_pwm = pwm;
    runtime.last_direction = requested_direction;

    if (runtime.last_print_ms == 0U ||
        isIntervalDue(now_ms, runtime.last_print_ms, config.print_interval_ms)) {
        runtime.last_print_ms = now_ms;
        const char* status = "run";
        if (target_zero) {
            status = "stop";
        } else if (direction_hold_active) {
            status = "direction_hold";
        } else if (!encoder_sample.valid) {
            status = "encoder_warmup";
        }
        n20ClosedLoopBenchPrint(runtime, elapsed_ms, status);
        runtime.csv_header_printed = true;
    }

    if (elapsed_ms >= config.profile_stop_ms &&
        runtime.last_target_rpm == 0.0f) {
        runtime.tb6612.writeOutput(Tb6612Channel::kB, Tb6612OutputMode::kCoast, 0.0f);
        runtime.tb6612.setStandby(false);
        stopN20EncoderBench();
        speedPidReset(runtime.pid);
        runtime.driver_ready = false;
        runtime.completed = true;
        Serial.println("[N20_CLOSED_LOOP] profile complete");
    }
}

void printRuntimeStatsIfDue() {
    if (!app_config::kEnableBridgeRuntimeDebug) {
        return;
    }
    if (app_config::kEnableN20ClosedLoopBench) {
        return;
    }

    const unsigned long now_ms = millis();
    if (last_runtime_debug_ms == 0) {
        last_runtime_debug_ms = now_ms;
        return;
    }
    if (!isIntervalDue(now_ms, last_runtime_debug_ms, app_config::kRuntimeStatsPrintIntervalMs)) {
        return;
    }

    static uint32_t last_ros_loop_count = 0U;
    static uint32_t last_motor_loop_count = 0U;
    static uint32_t last_imu_frame_count = 0U;
    static uint32_t last_state_frame_count = 0U;
    static uint32_t last_imu_publish_count = 0U;
    static uint32_t last_filtered_publish_count = 0U;
    static uint32_t last_robot_state_publish_count = 0U;
    static uint32_t last_motor_actual_publish_count = 0U;
    static uint32_t last_motor_state_publish_count = 0U;
    static uint32_t last_motor_status_publish_count = 0U;
    static uint32_t last_imu_publish_error_count = 0U;
    static uint32_t last_filtered_publish_error_count = 0U;
    static uint32_t last_state_publish_error_count = 0U;
    static uint32_t last_motor_actual_publish_error_count = 0U;
    static uint32_t last_motor_state_publish_error_count = 0U;
    static uint32_t last_motor_status_publish_error_count = 0U;

    const RuntimeTaskStats task_stats = snapshotRuntimeTaskStatsAndResetPeaks();
    const UrosPubStats pub_stats = urosPubGetStats();
    const uint32_t imu_frame_count = stm32_parser.imuFrameCount();
    const uint32_t state_frame_count = stm32_parser.stateFrameCount();
    const uint32_t ros_loop_delta = task_stats.ros_comm_loop_count - last_ros_loop_count;
    const uint32_t motor_loop_delta = task_stats.motor_control_loop_count - last_motor_loop_count;
    const uint32_t imu_frame_delta = imu_frame_count - last_imu_frame_count;
    const uint32_t state_frame_delta = state_frame_count - last_state_frame_count;

    Serial.print("[RUNTIME] window_ms=");
    Serial.print((last_runtime_debug_ms == 0) ? now_ms : now_ms - last_runtime_debug_ms);
    Serial.print(" ros_loop=");
    Serial.print(ros_loop_delta);
    Serial.print(" ros_max_interval_ms=");
    Serial.print(task_stats.ros_comm_max_loop_interval_ms);
    Serial.print(" motor_loop=");
    Serial.print(motor_loop_delta);
    Serial.print(" motor_max_jitter_ms=");
    Serial.println(task_stats.motor_control_max_jitter_ms);

    Serial.print("[RUNTIME] stm32_imu_frames=");
    Serial.print(imu_frame_delta);
    Serial.print(" robot_state_frames=");
    Serial.print(state_frame_delta);
    Serial.print(" stm32_dropped_total=");
    Serial.println(stm32_parser.droppedFrameCount());

    Serial.print("[RUNTIME] pub_ok imu=");
    Serial.print(pub_stats.imu_data_publish_count - last_imu_publish_count);
    Serial.print(" filtered=");
    Serial.print(pub_stats.filtered_imu_publish_count - last_filtered_publish_count);
    Serial.print(" robot_state=");
    Serial.print(pub_stats.robot_state_publish_count - last_robot_state_publish_count);
    Serial.print(" motor_actual=");
    Serial.print(pub_stats.motor_actual_rpm_publish_count - last_motor_actual_publish_count);
    Serial.print(" motor_state=");
    Serial.print(pub_stats.motor_state_publish_count - last_motor_state_publish_count);
    Serial.print(" motor_status=");
    Serial.println(pub_stats.motor_status_publish_count - last_motor_status_publish_count);

