inayina/ros2-robot-digital-twin/firmware/esp32_microros_bridge/src/main.cpp
    Serial.print("[RUNTIME] pub_err imu=");
    Serial.print(pub_stats.imu_data_publish_error_count - last_imu_publish_error_count);
    Serial.print(" filtered=");
    Serial.print(pub_stats.filtered_imu_publish_error_count - last_filtered_publish_error_count);
    Serial.print(" robot_state=");
    Serial.print(pub_stats.robot_state_publish_error_count - last_state_publish_error_count);
    Serial.print(" motor_actual=");
    Serial.print(pub_stats.motor_actual_rpm_publish_error_count - last_motor_actual_publish_error_count);
    Serial.print(" motor_state=");
    Serial.print(pub_stats.motor_state_publish_error_count - last_motor_state_publish_error_count);
    Serial.print(" motor_status=");
    Serial.println(pub_stats.motor_status_publish_error_count - last_motor_status_publish_error_count);

    Serial.print("[RUNTIME] free_heap=");
    Serial.print(ESP.getFreeHeap());
    Serial.print(" ros_stack_hwm_bytes=");
    Serial.print(stackHighWaterBytes(ros_comm_task_handle));
    Serial.print(" motor_stack_hwm_bytes=");
    Serial.println(stackHighWaterBytes(motor_control_task_handle));

    last_ros_loop_count = task_stats.ros_comm_loop_count;
    last_motor_loop_count = task_stats.motor_control_loop_count;
    last_imu_frame_count = imu_frame_count;
    last_state_frame_count = state_frame_count;
    last_imu_publish_count = pub_stats.imu_data_publish_count;
    last_filtered_publish_count = pub_stats.filtered_imu_publish_count;
    last_robot_state_publish_count = pub_stats.robot_state_publish_count;
    last_motor_actual_publish_count = pub_stats.motor_actual_rpm_publish_count;
    last_motor_state_publish_count = pub_stats.motor_state_publish_count;
    last_motor_status_publish_count = pub_stats.motor_status_publish_count;
    last_imu_publish_error_count = pub_stats.imu_data_publish_error_count;
    last_filtered_publish_error_count = pub_stats.filtered_imu_publish_error_count;
    last_state_publish_error_count = pub_stats.robot_state_publish_error_count;
    last_motor_actual_publish_error_count = pub_stats.motor_actual_rpm_publish_error_count;
    last_motor_state_publish_error_count = pub_stats.motor_state_publish_error_count;
    last_motor_status_publish_error_count = pub_stats.motor_status_publish_error_count;
    last_runtime_debug_ms = now_ms;
}

Tb6612DriverConfig makeTb6612ChannelABenchConfig() {
    Tb6612DriverConfig config = tb6612MakeUnsetDriverConfig();

    config.channel_a.pwm_pin = app_config::kTb6612BenchChannelAPwmPin;
    config.channel_a.dir_in1_pin = app_config::kTb6612BenchChannelADirIn1Pin;
    config.channel_a.dir_in2_pin = app_config::kTb6612BenchChannelADirIn2Pin;
    config.channel_a.pwm_channel = app_config::kTb6612BenchChannelAPwmChannel;
    config.channel_a.pwm_frequency_hz = app_config::kTb6612BenchPwmFrequencyHz;
    config.channel_a.pwm_resolution_bits = app_config::kTb6612BenchPwmResolutionBits;
    config.channel_a.invert_direction = false;
    config.standby_pin = app_config::kTb6612BenchStandbyPin;
    config.standby_active_high = true;
    config.enable_on_begin = false;
    return config;
}

Tb6612DriverConfig makeTb6612ChannelBBenchConfig() {
    Tb6612DriverConfig config = tb6612MakeUnsetDriverConfig();

    config.channel_b.pwm_pin = app_config::kTb6612BenchChannelBPwmPin;
    config.channel_b.dir_in1_pin = app_config::kTb6612BenchChannelBDirIn1Pin;
    config.channel_b.dir_in2_pin = app_config::kTb6612BenchChannelBDirIn2Pin;
    config.channel_b.pwm_channel = app_config::kTb6612BenchChannelBPwmChannel;
    config.channel_b.pwm_frequency_hz = app_config::kTb6612BenchPwmFrequencyHz;
    config.channel_b.pwm_resolution_bits = app_config::kTb6612BenchPwmResolutionBits;
    config.channel_b.invert_direction = false;
    config.standby_pin = app_config::kTb6612BenchStandbyPin;
    config.standby_active_high = true;
    config.enable_on_begin = false;
    return config;
}

void runTb6612ChannelABenchTest() {
    if (!app_config::kEnableTb6612ChannelABenchTest) {
        return;
    }

    Tb6612Driver tb6612;
    Serial.println("[TB6612] A-channel 130 motor bench test starting");
    Serial.println("[TB6612] sequence: coast -> forward pulse -> coast -> reverse pulse -> coast");

    if (!tb6612.begin(makeTb6612ChannelABenchConfig())) {
        Serial.println("[TB6612] init failed; check bench pin config");
        return;
    }

    tb6612.setStandby(true);
    tb6612.writeOutput(Tb6612Channel::kA, Tb6612OutputMode::kCoast, 0.0f);
    vTaskDelay(pdMS_TO_TICKS(app_config::kTb6612BenchCoastMs));

    Serial.println("[TB6612] A forward low-duty pulse");
    tb6612.writeDuty(Tb6612Channel::kA, app_config::kTb6612BenchTestDuty);
    vTaskDelay(pdMS_TO_TICKS(app_config::kTb6612BenchPulseMs));

    Serial.println("[TB6612] A coast");
    tb6612.writeOutput(Tb6612Channel::kA, Tb6612OutputMode::kCoast, 0.0f);
    vTaskDelay(pdMS_TO_TICKS(app_config::kTb6612BenchCoastMs));

    Serial.println("[TB6612] A reverse low-duty pulse");
    tb6612.writeDuty(Tb6612Channel::kA, -app_config::kTb6612BenchTestDuty);
    vTaskDelay(pdMS_TO_TICKS(app_config::kTb6612BenchPulseMs));

    tb6612.writeOutput(Tb6612Channel::kA, Tb6612OutputMode::kCoast, 0.0f);
    tb6612.setStandby(false);
    Serial.println("[TB6612] A-channel bench test complete; driver standby disabled");
}

void runTb6612ChannelBBenchTest() {
    if (!app_config::kEnableTb6612ChannelBBenchTest ||
        app_config::kEnableN20ClosedLoopBench) {
        return;
    }

    Tb6612Driver tb6612;
    Serial.println("[TB6612] B-channel N20 bench test starting");
    Serial.println("[TB6612] sequence: coast -> forward pulse -> coast -> reverse pulse -> coast");

    if (!tb6612.begin(makeTb6612ChannelBBenchConfig())) {
        Serial.println("[TB6612] init failed; check B-channel bench pin config");
        return;
    }

    startN20EncoderBench();
    const int32_t start_count = n20EncoderBenchCountSnapshot();

    tb6612.setStandby(true);
    tb6612.writeOutput(Tb6612Channel::kB, Tb6612OutputMode::kCoast, 0.0f);
    vTaskDelay(pdMS_TO_TICKS(app_config::kTb6612BenchCoastMs));

