inayina/ros2-robot-digital-twin/firmware/esp32_microros_bridge/src/main.cpp
void handleTargetRpm(float target_rpm) {
    static unsigned long last_target_rpm_debug_ms = 0;

    motorSharedSetTargetRpm(target_rpm, millis());

    if (!app_config::kEnableTargetRpmDebug) {
        return;
    }

    if ((millis() - last_target_rpm_debug_ms) < app_config::kTargetRpmDebugIntervalMs) {
        return;
    }

    Serial.print("[TARGET_RPM] core=");
    Serial.print(xPortGetCoreID());
    Serial.print(" rpm=");
    Serial.println(target_rpm, 3);
    last_target_rpm_debug_ms = millis();
}

void handleMotorCmd(const char* payload) {
    static unsigned long last_motor_cmd_debug_ms = 0;
    static unsigned long last_motor_cmd_error_ms = 0;

    MotorCommandMessage command = {};
    if (!motorCommandParseJson(payload, command)) {
        if ((millis() - last_motor_cmd_error_ms) >= 1000UL) {
            Serial.print("[MOTOR_CMD] invalid payload: ");
            Serial.println(payload == nullptr ? "<null>" : payload);
            last_motor_cmd_error_ms = millis();
        }
        return;
    }

    const bool enabled = command.has_enabled ? command.enabled : true;
    const bool closed_loop = command.has_closed_loop ? command.closed_loop : true;
    const bool stop_requested = command.has_stop ? command.stop : false;
    const float target_rpm = command.has_target_rpm ? command.target_rpm : 0.0f;
    const float max_pwm = command.has_max_pwm ? command.max_pwm : 0.0f;
    const uint32_t timeout_ms = command.has_timeout_ms ? command.timeout_ms : 0U;
    const bool hardware_enable =
        command.has_hardware_enable ? command.hardware_enable : (enabled && !stop_requested);

    motorControllerSetHardwareOutputsEnabled(hardware_enable);

    motorSharedSetMotorCmd(
        target_rpm,
        enabled,
        closed_loop,
        max_pwm,
        timeout_ms,
        stop_requested,
        millis());

    if ((millis() - last_motor_cmd_debug_ms) < app_config::kTargetRpmDebugIntervalMs) {
        return;
    }

    Serial.print("[MOTOR_CMD] rpm=");
    Serial.print(target_rpm, 3);
    Serial.print(" enabled=");
    Serial.print(enabled ? 1 : 0);
    Serial.print(" closed_loop=");
    Serial.print(closed_loop ? 1 : 0);
    Serial.print(" max_pwm=");
    Serial.print(max_pwm, 3);
    Serial.print(" timeout_ms=");
    Serial.print(timeout_ms);
    Serial.print(" stop=");
    Serial.print(stop_requested ? 1 : 0);
    Serial.print(" hw_enable=");
    Serial.println(hardware_enable ? 1 : 0);
    last_motor_cmd_debug_ms = millis();
}

bool createMicroRosEntities() {
    Serial.print("Connecting to micro-ROS Agent at ");
    Serial.print(app_config::kAgentIp);
    Serial.print(":");
    Serial.println(app_config::kAgentPort);

    if (!transport_configured) {
        configureMicroRosTransport();
    }

    delay(app_config::kTransportSettleDelayMs);

    if (!urosCoreInit(Serial, app_config::kRosNodeName)) {
        return false;
    }
    if (!urosPubInit(Serial, app_config::kImuFilterAlpha)) {
        urosCoreFini(Serial);
        return false;
    }
    if (!urosSubInit(Serial)) {
        urosPubFini(Serial);
        urosCoreFini(Serial);
        return false;
    }

    urosSubSetCmdVelCallback(handleCmdVel);
    urosSubSetTargetRpmCallback(handleTargetRpm);
    urosSubSetMotorCmdCallback(handleMotorCmd);
    Serial.println("micro-ROS connected!");
    return true;
}

void destroyMicroRosEntities(const char* reason) {
    if (reason != nullptr && reason[0] != '\0') {
        Serial.println(reason);
    }

    urosSubFini(Serial);
    urosPubFini(Serial);
    urosCoreFini(Serial);
}

void serviceWiFiConnection() {
    const wl_status_t status = WiFi.status();

    if (status == WL_CONNECTED) {
        if (!wifi_connected) {
            wifi_connected = true;
            Serial.print("WiFi Connected! IP: ");
            Serial.println(WiFi.localIP());
            if (!transport_configured) {
                configureMicroRosTransport();
            }
            last_micro_ros_init_attempt_ms = 0;
        }
        return;
    }

    if (wifi_connected) {
        wifi_connected = false;
        Serial.println("WiFi disconnected, waiting to reconnect...");
        if (micro_ros_initialized) {
            destroyMicroRosEntities("WiFi lost, tearing down micro-ROS entities...");
            micro_ros_initialized = false;
        }
    }

    if ((millis() - last_wifi_attempt_ms) >= app_config::kWifiRetryIntervalMs) {
        startWiFiConnectionAttempt();
    }
}

void serviceMicroRosConnection() {
    if (!wifi_connected || micro_ros_initialized) {
        return;
    }

    if (last_micro_ros_init_attempt_ms != 0 &&
        (millis() - last_micro_ros_init_attempt_ms) < app_config::kMicroRosInitRetryIntervalMs) {
        return;
    }

    last_micro_ros_init_attempt_ms = millis();

    if (createMicroRosEntities()) {
        micro_ros_initialized = true;
        return;
    }

    destroyMicroRosEntities("Failed to create micro-ROS entities, retrying...");
}

void serviceConnectedRuntime() {
    if (!micro_ros_initialized) {
        return;
    }

    urosSubSpinSome(app_config::kExecutorSpinTimeoutMs);

    const unsigned long now_ms = millis();
    if (isIntervalDue(now_ms,
                      last_motor_actual_rpm_publish_ms,
                      app_config::kMotorActualRpmPublishIntervalMs)) {
        const MotorControlStateSnapshot motor_state = motorSharedGetState();
        urosPubPublishMotorActualRpm(motor_state.actual_rpm);
        last_motor_actual_rpm_publish_ms = now_ms;
    }

    if (isIntervalDue(now_ms,
                      last_motor_state_json_publish_ms,
                      app_config::kMotorStateJsonPublishIntervalMs)) {
        const MotorControlStateSnapshot motor_state = motorSharedGetState();
        urosPubPublishMotorState(motor_state);
        last_motor_state_json_publish_ms = now_ms;
    }
}

void rosCommTask(void* /*arg*/) {
    esp_task_wdt_add(NULL);

    Serial.print("ros_comm_task started on core ");
    Serial.println(xPortGetCoreID());
    startWiFiConnectionAttempt();

